Repository: Jackeeet/warbler
Catalog: Warbler/Resources/Errors/Checker.*.resx
Languages: ru

# NegateNonBoolean
source: The '!' operator can only be used with Boolean expressions
ru: Оператор '!' может быть применен только к выражениям типа Boolean

# NegateNonNumeric
source: The '-' operator can only be used with Double or Integer expressions
ru: Оператор '-' может быть применен только к выражениям типов Double или Integer

# NonNumericBinaryOperands
source: Both operands must be either Integer or Double
ru: Оба операнда должны иметь тип Integer или Double

# NonStringConcatenation
source: The '++' operator can only be used with expressions of type String
ru: Оператор '++' может быть применен только к выражениям типа String

# ComparisonOperandsMismatch
source: Cannot compare expressions of types {0} and {1}
ru: Нельзя сравнивать выражения типов {0} и {1}

# NonBooleanCondition
source: A ternary condition must be Boolean
ru: Условие должно иметь тип Boolean

# TernaryBranchesMismatch
source: Ternary branches must have the same type
ru: Ветви условного выражения должны иметь один и тот же тип

# VariableAssignmentMismatch
source: Expected an expression of type {0}
ru: Ожидается выражение типа {0}

# ConditionBranchesMismatch
source: Conditional expression branches must have the same type
ru: Ветви условного выражения должны иметь один и тот же тип

# FunctionSignatureMismatch
source: The type of the function's body does not match the function's return type
ru: Тип тела функции не совпадает с типом возвращаемого значения этой функции

# CallUncallable
source: Cannot call {0}
ru: Нельзя вызвать {0}

# ArgumentCountMismatch
source: Expected {0} arguments
ru: Ожидается {0} аргументов функции

# ArgumentTypeMismatch
source: Expected an argument of type {0}
ru: Ожидается аргумент типа {0}
