Repository: Jackeeet/warbler
Catalog: Warbler/Resources/Errors/Syntax.*.resx
Languages: ru

# ApostropheAtEof
source: Unexpected character ' at end of input
ru: Неожиданный символ ' в конце входных данных

# EmptyChar
source: Empty character literal at position {0}
ru: На позиции {0} ожидается символ

# ExpectedClosingBracket
source: Expected a ) after an expression
ru: После выражения ожидается символ )

# ExpectedColon
source: Expected a :
ru: Ожидается символ :

# ExpectedExpression
source: Expected an expression
ru: Ожидается выражение

# UnexpectedChar
source: Unexpected character {0} at position {1}
ru: Неизвестный символ {0} на позиции {1}

# UnexpectedToken
source: Unexpected token {0}
ru: Неожиданный токен {0}

# UnknownEscape
source: Unknown escape sequence at position {0}
ru: Неизвестная escape-последовательность на позиции {0}

# UnterminatedString
source: Expected a " at position {0}
ru: На позиции {0} ожидается закрывающий символ "

# UnterminatedChar
source: Expected a closing ' at position {0}
ru: На позиции {0} ожидается закрывающий символ '

# ExpectedAssignment
source: Expected a =
ru: Ожидается символ =

# ExpectedIdentifier
source: Expected an identifier
ru: Ожидается идентификатор

source: Invalid assignment target
ru: Невозможно присвоить значение

# UnterminatedBlock
source: Expected a closing <: after block
ru: В конце блока ожидаются закрывающие символы <:
